In [2]:
import pandas as pd
import numpy as np

In [5]:
serie=pd.Series([1,2,'eugenio',np.nan,'123'])

In [12]:
print(serie)
print(serie.dtypes)

0          1
1          2
2    eugenio
3        NaN
4        123
dtype: object
object

Creating a DataFrame by passing a NumPy array, with a datetime index and labeled columns:

In [14]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.001730  0.636277 -1.490912  0.418288
2013-01-02  1.312420 -1.099420 -1.912845 -0.569000
2013-01-03  0.200057  0.048383  0.749606 -1.206878
2013-01-04 -0.704137  0.391524  0.151710 -1.553157
2013-01-05 -0.409558  0.067158  0.017589 -0.383013
2013-01-06  1.017164 -1.220286  2.825536  0.121039

Creating a DataFrame by passing a dict of objects that can be converted to series-like

In [34]:
df3 = pd.DataFrame({'A': 1.,
 'B': pd.Timestamp('20130102'),
 'D': np.array([3] * 5, dtype='int32'),
 'E': pd.Categorical(["test", "train", "test", "train","train"]),
 'F': 'foo'})
df3

     A          B  D      E    F
0  1.0 2013-01-02  3   test  foo
1  1.0 2013-01-02  3  train  foo
2  1.0 2013-01-02  3   test  foo
3  1.0 2013-01-02  3  train  foo
4  1.0 2013-01-02  3  train  foo

In [35]:
df3.index

RangeIndex(start=0, stop=5, step=1)

In [22]:
df2 = pd.DataFrame({'A': 1.,
 'B': pd.Timestamp('20130102'),
 'C': pd.Series(1, index=list(range(4)), dtype='float32'),
 'D': np.array([3] * 4, dtype='int32'),
 'E': pd.Categorical(["test", "train", "test", "train"]),
 'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [36]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [23]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [24]:
df.head()

                   A         B         C         D
2013-01-01  1.001730  0.636277 -1.490912  0.418288
2013-01-02  1.312420 -1.099420 -1.912845 -0.569000
2013-01-03  0.200057  0.048383  0.749606 -1.206878
2013-01-04 -0.704137  0.391524  0.151710 -1.553157
2013-01-05 -0.409558  0.067158  0.017589 -0.383013

In [25]:
df.tail(2)

                   A         B         C         D
2013-01-05 -0.409558  0.067158  0.017589 -0.383013
2013-01-06  1.017164 -1.220286  2.825536  0.121039

In [26]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [27]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [28]:
df.to_numpy()

array([[ 1.0017299 ,  0.63627747, -1.49091179,  0.41828779],
       [ 1.31242049, -1.09941959, -1.91284475, -0.56899951],
       [ 0.20005728,  0.04838264,  0.7496061 , -1.20687799],
       [-0.70413728,  0.39152409,  0.15170994, -1.55315679],
       [-0.40955796,  0.06715782,  0.01758948, -0.38301313],
       [ 1.01716437, -1.22028593,  2.82553607,  0.12103903]])

In [29]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.402946 -0.196061  0.056781 -0.528787
std    0.835453  0.778739  1.698902  0.755147
min   -0.704137 -1.220286 -1.912845 -1.553157
25%   -0.257154 -0.812469 -1.113786 -1.047408
50%    0.600894  0.057770  0.084650 -0.476006
75%    1.013306  0.310433  0.600132 -0.004974
max    1.312420  0.636277  2.825536  0.418288

Traspuesta

In [38]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.001730    1.312420    0.200057   -0.704137   -0.409558    1.017164
B    0.636277   -1.099420    0.048383    0.391524    0.067158   -1.220286
C   -1.490912   -1.912845    0.749606    0.151710    0.017589    2.825536
D    0.418288   -0.569000   -1.206878   -1.553157   -0.383013    0.121039

Ordena por columnas

In [43]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.418288 -1.490912  0.636277  1.001730
2013-01-02 -0.569000 -1.912845 -1.099420  1.312420
2013-01-03 -1.206878  0.749606  0.048383  0.200057
2013-01-04 -1.553157  0.151710  0.391524 -0.704137
2013-01-05 -0.383013  0.017589  0.067158 -0.409558
2013-01-06  0.121039  2.825536 -1.220286  1.017164

Ordena por filas

In [44]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2013-01-06  1.017164 -1.220286  2.825536  0.121039
2013-01-05 -0.409558  0.067158  0.017589 -0.383013
2013-01-04 -0.704137  0.391524  0.151710 -1.553157
2013-01-03  0.200057  0.048383  0.749606 -1.206878
2013-01-02  1.312420 -1.099420 -1.912845 -0.569000
2013-01-01  1.001730  0.636277 -1.490912  0.418288

Ordena por valor - especificando una columna

In [45]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-06  1.017164 -1.220286  2.825536  0.121039
2013-01-02  1.312420 -1.099420 -1.912845 -0.569000
2013-01-03  0.200057  0.048383  0.749606 -1.206878
2013-01-05 -0.409558  0.067158  0.017589 -0.383013
2013-01-04 -0.704137  0.391524  0.151710 -1.553157
2013-01-01  1.001730  0.636277 -1.490912  0.418288

Obtener una seccion

In [47]:
# Subconjunto por un determinado valor del indice
df.loc[dates[0]]

A    1.001730
B    0.636277
C   -1.490912
D    0.418288
Name: 2013-01-01 00:00:00, dtype: float64

In [49]:
# Subconjunto por una determinada columna
df.loc[:,['À','B','D']]

             À         B         D
2013-01-01 NaN  0.636277  0.418288
2013-01-02 NaN -1.099420 -0.569000
2013-01-03 NaN  0.048383 -1.206878
2013-01-04 NaN  0.391524 -1.553157
2013-01-05 NaN  0.067158 -0.383013
2013-01-06 NaN -1.220286  0.121039

Subconjunto por etiqueta y columna

In [58]:
df.loc['20130102':'20130104', ['A', 'C']]

                   A         C
2013-01-02  1.312420 -1.912845
2013-01-03  0.200057  0.749606
2013-01-04 -0.704137  0.151710

In [56]:
df2.loc[2:4, 'A':'C']

     A          B    C
2  1.0 2013-01-02  1.0
3  1.0 2013-01-02  1.0

For getting fast access to a scalar:

In [57]:
df.at[dates[0], 'A']

1.0017299033794087

Selecciona por posicion del indice. iloc[3] seria la cuarta fila

In [70]:
df

                   A         B         C         D
2013-01-01  1.001730  0.636277 -1.490912  0.418288
2013-01-02  1.312420 -1.099420 -1.912845 -0.569000
2013-01-03  0.200057  0.048383  0.749606 -1.206878
2013-01-04 -0.704137  0.391524  0.151710 -1.553157
2013-01-05 -0.409558  0.067158  0.017589 -0.383013
2013-01-06  1.017164 -1.220286  2.825536  0.121039

In [71]:
df.iloc[3]

A   -0.704137
B    0.391524
C    0.151710
D   -1.553157
Name: 2013-01-04 00:00:00, dtype: float64

In [108]:
df.iloc[2:3,3]

2013-01-03    5
Freq: D, Name: D, dtype: int32

In [74]:
s1 = pd.Series(np.random.randn(5), index=list(range(0, 10, 2)))
s1

0    0.382103
2    0.462449
4    1.210625
6    0.930604
8   -0.684365
dtype: float64

In [75]:
s1.iloc[:3]

0    0.382103
2    0.462449
4    1.210625
dtype: float64

Boolean indexing

In [76]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  1.001730  0.636277 -1.490912  0.418288
2013-01-02  1.312420 -1.099420 -1.912845 -0.569000
2013-01-03  0.200057  0.048383  0.749606 -1.206878
2013-01-06  1.017164 -1.220286  2.825536  0.121039

In [77]:
df.B

2013-01-01    0.636277
2013-01-02   -1.099420
2013-01-03    0.048383
2013-01-04    0.391524
2013-01-05    0.067158
2013-01-06   -1.220286
Freq: D, Name: B, dtype: float64

In [78]:
df2 = df.copy()

In [79]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  1.001730  0.636277 -1.490912  0.418288    one
2013-01-02  1.312420 -1.099420 -1.912845 -0.569000    one
2013-01-03  0.200057  0.048383  0.749606 -1.206878    two
2013-01-04 -0.704137  0.391524  0.151710 -1.553157  three
2013-01-05 -0.409558  0.067158  0.017589 -0.383013   four
2013-01-06  1.017164 -1.220286  2.825536  0.121039  three

In [80]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  0.200057  0.048383  0.749606 -1.206878   two
2013-01-05 -0.409558  0.067158  0.017589 -0.383013  four

In [81]:
df2[df2.E.isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  0.200057  0.048383  0.749606 -1.206878   two
2013-01-05 -0.409558  0.067158  0.017589 -0.383013  four

Especificando valores

In [89]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
df['F']=s1

Por posicion

In [90]:
df.at[dates[0], 'A'] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.636277 -1.490912  0.418288  NaN
2013-01-02  1.312420 -1.099420 -1.912845 -0.569000  1.0
2013-01-03  0.200057  0.048383  0.749606 -1.206878  2.0
2013-01-04 -0.704137  0.391524  0.151710 -1.553157  3.0
2013-01-05 -0.409558  0.067158  0.017589 -0.383013  4.0
2013-01-06  1.017164 -1.220286  2.825536  0.121039  5.0

In [ ]:
iat es por posicion, iat[0, 3] son las posiciones 0 y 3, en nuestro caso fila 0, columnas 0 y 3 respectivamente

In [91]:
df.iat[0, 1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -1.490912  0.418288  NaN
2013-01-02  1.312420 -1.099420 -1.912845 -0.569000  1.0
2013-01-03  0.200057  0.048383  0.749606 -1.206878  2.0
2013-01-04 -0.704137  0.391524  0.151710 -1.553157  3.0
2013-01-05 -0.409558  0.067158  0.017589 -0.383013  4.0
2013-01-06  1.017164 -1.220286  2.825536  0.121039  5.0

In [94]:
len(df)

6

In [95]:
df.loc[:, 'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.490912  5  NaN
2013-01-02  1.312420 -1.099420 -1.912845  5  1.0
2013-01-03  0.200057  0.048383  0.749606  5  2.0
2013-01-04 -0.704137  0.391524  0.151710  5  3.0
2013-01-05 -0.409558  0.067158  0.017589  5  4.0
2013-01-06  1.017164 -1.220286  2.825536  5  5.0

In [98]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.490912 -5  NaN
2013-01-02 -1.312420 -1.099420 -1.912845 -5 -1.0
2013-01-03 -0.200057 -0.048383 -0.749606 -5 -2.0
2013-01-04 -0.704137 -0.391524 -0.151710 -5 -3.0
2013-01-05 -0.409558 -0.067158 -0.017589 -5 -4.0
2013-01-06 -1.017164 -1.220286 -2.825536 -5 -5.0

In [106]:
df2[df2 < -1]=df
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.490912  5  NaN
2013-01-02  1.312420 -1.099420 -1.912845  5 -1.0
2013-01-03 -0.200057 -0.048383 -0.749606  5  2.0
2013-01-04 -0.704137 -0.391524 -0.151710  5  3.0
2013-01-05 -0.409558 -0.067158 -0.017589  5  4.0
2013-01-06  1.017164 -1.220286  2.825536  5  5.0